Мониторинг/src/Documents/ПереоценкаНоменклатуры/ПереоценкаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереоценкаНоменклатуры</name>
  <basedOn>Document.СогласованиеЦен</basedOn>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласовниеОснование</name>
    <type>
      <types>DocumentRef.СогласованиеЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяКатегорияЦены</name>
      <type>
        <types>CatalogRef.КатегорииЦен</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мониторинг/src/Documents/ПереоценкаНоменклатуры/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СогласованиеЦен") Тогда
		// Заполнение шапки
		СогласовниеОснование = ДанныеЗаполнения.Ссылка;
		
		Для Каждого ТекСтрокаТЧ_Согласование Из ДанныеЗаполнения.ТЧ_Согласование Цикл
			Если ТекСтрокаТЧ_Согласование.СтатусПереоценки>0 Тогда 
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Магазин = ТекСтрокаТЧ_Согласование.Исполнитель;
				//НоваяСтрока.Комментарий = ?(ЗначениеЗаполнено(ТекСтрокаТЧ_Согласование.КомменатрийРуководителя),ТекСтрокаТЧ_Согласование.КомменатрийРуководителя,ТекСтрокаТЧ_Согласование.Комментарий);
				Если ЗначениеЗаполнено(ТекСтрокаТЧ_Согласование.Комментарий) Тогда 
					НоваяСтрока.Комментарий = ТекСтрокаТЧ_Согласование.Комментарий;
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекСтрокаТЧ_Согласование.КомменатрийРуководителя) Тогда 
					НоваяСтрока.Комментарий = НоваяСтрока.Комментарий + "; Согласование ("+СогласовниеОснование.Ответственный+"): " + ТекСтрокаТЧ_Согласование.КомменатрийРуководителя;
				КонецЕсли;
				НоваяСтрока.Цена = ТекСтрокаТЧ_Согласование.НоваяЦена;
				НоваяСтрока.Номенклатура = ТекСтрокаТЧ_Согласование.Номенклатура;
				НоваяСтрока.КатегорияНоменклатуры = ТекСтрокаТЧ_Согласование.КатегорияНоменклатуры;
				НоваяСтрока.НоваяКатегорияЦены = ТекСтрокаТЧ_Согласование.НоваяКатегорияЦены;
			КонецЕсли;
		КонецЦикла;
		ТЗ_Даты = ДанныеЗаполнения.ТЧ_Согласование.Выгрузить(,"ДатаМониторинга");
		ТЗ_Даты.Свернуть("ДатаМониторинга");
		МассивДат = ТЗ_Даты.ВыгрузитьКолонку("ДатаМониторинга");
		Комментарий = "Мониторинг от ";
		Для Каждого ДатаМониторинга Из МассивДат Цикл 
			Комментарий = Комментарий + Формат(ДатаМониторинга,"ДФ=yy-MM-dd") + ","; 
		КонецЦикла;
		
		Если СтрДлина(Комментарий)>2 Тогда 
			Комментарий = Лев(Комментарий, СтрДлина(Комментарий)-1);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
